{
  "고등": [
    "수학과 - 공통수학1 - (1) 다항식 - 10학년 - 식에 대한 사칙연산과 인수분해는 복잡한 다항식으로 확장되어 적용된다. 다항식의 연산, 나머지정리, 인수분해 등을 다룬다.",
    "수학과 - 공통수학1 - (2) 방정식과 부등식 - 10학년 - 방정식과 부등식은 적절한 절차를 통해 해결된다. 복소수, 허수, 이차방정식, 이차함수, 여러 가지 방정식과 부등식 등을 다룬다.",
    "수학과 - 공통수학1 - (3) 경우의 수 - 10학년 - 순열과 조합은 다양한 상황에서 사건이 일어날 수 있는 모든 경우의 수를 체계적으로 세는 데 활용된다. 합의 법칙과 곱의 법칙, 순열과 조합 등을 다룬다.",
    "수학과 - 공통수학1 - (4) 행렬 - 10학년 - 여러 값이 포함된 자료는 행렬 표현과 연산을 통해 효율적으로 처리된다. 행렬과 그 연산을 다룬다.",
    "수학과 - 공통수학2 - (1) 도형의 방정식 - 10학년 - 평면도형을 식으로 표현하는 것은 도형 사이의 위치 관계와 도형의 이동에 대한 탐구의 유용한 도구가 된다. 평면좌표, 직선의 방정식, 원의 방정식, 도형의 이동 등을 다룬다.",
    "수학과 - 공통수학2 - (2) 집합과 명제 - 10학년 - 집합은 대상을 논리적으로 표현하고 이해하는 도구이며, 명제는 추론을 통해 증명된다. 집합과 명제를 다룬다.",
    "수학과 - 공통수학2 - (3) 함수와 그래프 - 10학년 - 두 집합 사이의 대응으로 일반화된 함수는 대상 간의 관계를 논리적으로 해석하는 데 활용된다. 함수, 유리함수, 무리함수 등을 다룬다.",
    "수학과 - 기본수학1 - (1) 다항식 - 10학년 - 식에 대한 사칙연산과 인수분해는 복잡한 다항식으로 확장되어 적용된다. 다항식의 연산, 인수분해 등을 다룬다.",
    "수학과 - 기본수학1 - (2) 방정식과 부등식 - 10학년 - 방정식과 부등식은 적절한 절차를 통해 해결된다. 이차방정식, 이차함수, 부등식 등을 다룬다.",
    "수학과 - 기본수학1 - (3) 경우의 수 - 10학년 - 순열과 조합은 다양한 상황에서 사건이 일어날 수 있는 모든 경우의 수를 체계적으로 세는 데 활용된다. 합의 법칙과 곱의 법칙, 순열과 조합 등을 다룬다.",
    "수학과 - 기본수학1 - (4) 행렬 - 10학년 - 여러 값이 포함된 자료는 행렬 표현과 연산을 통해 효율적으로 처리된다. 행렬과 그 연산을 다룬다.",
    "수학과 - 기본수학2 - (1) 도형의 방정식 - 10학년 - 평면도형을 식으로 표현하는 것은 도형 사이의 위치 관계와 도형의 이동에 대한 탐구의 유용한 도구가 된다. 평면좌표, 직선의 방정식, 원의 방정식, 도형의 이동 등을 다룬다.",
    "수학과 - 기본수학2 - (2) 집합과 명제 - 10학년 - 집합은 대상을 논리적으로 표현하고 이해하는 도구이며, 명제는 추론을 통해 증명된다. 집합과 명제를 다룬다.",
    "수학과 - 기본수학2 - (3) 함수와 그래프 - 10학년 - 두 집합 사이의 대응으로 일반화된 함수는 대상 간의 관계를 논리적으로 해석하는 데 활용된다. 함수, 유리함수, 무리함수 등을 다룬다.",
    "수학과 - 대수 - (1) 지수함수와 로그함수 - 11~12학년 - 지수함수, 로그함수는 급격히 증감하는 대상이나 현상을 표현하고 이해하는 데 활용된다. 지수와 로그, 지수함수와 로그함수를 다룬다.",
    "수학과 - 대수 - (2) 삼각함수 - 11~12학년 - 삼각함수는 주기적으로 변하는 대상이나 현상을 표현하고 이해하는 데 활용된다. 삼각함수, 사인법칙, 코사인법칙 등을 다룬다.",
    "수학과 - 대수 - (3) 수열 - 11~12학년 - 수열은 나열된 대상의 규칙을 수학적으로 표현하고 이해하는 데 활용되며, 수학적 귀납법은 자연수에 대해 성립하는 명제를 증명할 때 사용된다. 등차수열, 등비수열, 수열의 합, 수학적 귀납법 등을 다룬다.",
    "수학과 - 미적분Ⅰ - (1) 함수의 극한과 연속 - 11~12학년 - 함수의 극한은 함수의 국소적 성질을 이해하는 도구이며, 함수의 연속은 함수의 극한을 통해 설명된다. 함수의 극한과 함수의 연속을 다룬다.",
    "수학과 - 미적분Ⅰ - (2) 미분 - 11~12학년 - 미분은 함수의 순간적인 변화를 나타내는 도구이며 함수의 그래프와 이동하는 물체의 움직임에 대한 탐구에 활용된다. 미분계수, 도함수 등을 다룬다.",
    "수학과 - 미적분Ⅰ - (3) 적분 - 11~12학년 - 부정적분은 미분과 역관계에 있고 정적분을 계산하는 데 이용되며, 정적분은 도형의 넓이, 물체의 이동 거리 등을 구하는 데 활용된다. 부정적분, 정적분을 다룬다.",
    "수학과 - 확률과 통계 - (1) 경우의 수 - 11~12학년 - 순열과 조합, 이항정리 등을 다룬다.",
    "수학과 - 확률과 통계 - (2) 확률 - 11~12학년 - 확률의 개념, 확률의 활용, 조건부확률 등을 다룬다.",
    "수학과 - 확률과 통계 - (3) 통계 - 11~12학년 - 확률분포, 통계적 추정을 다룬다.",
    "수학과 - 미적분Ⅱ - (1) 수열의 극한 - 11~12학년 - 수열의 극한, 급수를 다룬다.",
    "수학과 - 미적분Ⅱ - (2) 미분법 - 11~12학년 - 여러 가지 함수의 미분, 여러 가지 미분법, 도함수 등을 다룬다.",
    "수학과 - 미적분Ⅱ - (3) 적분법 - 11~12학년 - 여러 가지 함수의 적분법, 정적분 등을 다룬다.",
    "수학과 - 기하 - (1) 이차곡선 - 11~12학년 - 이차곡선을 다룬다.",
    "수학과 - 기하 - (2) 공간도형과 공간좌표 - 11~12학년 - 공간도형, 공간좌표를 다룬다.",
    "수학과 - 기하 - (3) 벡터 - 11~12학년 - 벡터의 연산, 벡터의 성분과 내적, 도형의 방정식 등을 다룬다.",
    "수학과 - 경제 수학 - (1) 수와 경제 - 11~12학년 - 경제와 관련하여 자료의 해석, 식의 계산, 수열과 급수 등을 다룬다.",
    "수학과 - 경제 수학 - (2) 함수와 경제 - 11~12학년 - 경제와 관련된 함수를 다룬다.",
    "수학과 - 경제 수학 - (3) 행렬과 경제 - 11~12학년 - 경제와 관련된 행렬을 다룬다.",
    "수학과 - 경제 수학 - (4) 미분과 경제 - 11~12학년 - 경제와 관련된 미분을 다룬다.",
    "수학과 - 인공지능 수학 - (1) 인공지능과 빅데이터 - 11~12학년 - 인공지능의 개념과 역사, 빅데이터와 인공지능을 다룬다.",
    "수학과 - 인공지능 수학 - (2) 텍스트 데이터 처리 - 11~12학년 - 집합, 벡터, 행렬 등은 인공지능의 데이터 처리에 이용된다. 텍스트 데이터 표현, 텍스트 데이터 분석을 다룬다.",
    "수학과 - 인공지능 수학 - (3) 이미지 데이터 처리 - 11~12학년 - 집합, 벡터, 행렬 등은 인공지능의 데이터 처리에 이용된다. 이미지 데이터 표현, 이미지 데이터 분석을 다룬다.",
    "수학과 - 인공지능 수학 - (4) 예측과 최적화 - 11~12학년 - 확률, 함수, 미분 등에 기반한 인공지능 기술은 데이터의 경향성을 파악하고 최적화하며 합리적인 의사 결정을 하는 데 활용된다. 경향성과 예측, 최적화를 다룬다.",
    "수학과 - 인공지능 수학 - (5) 인공지능과 수학 탐구 - 11~12학년 - 인공지능으로 실생활 문제를 해결하는 수학적 원리를 다룬다.",
    "수학과 - 직무 수학 - (1) 수와 연산 - 11~12학년 - 업무와 관련해 수와 사칙연산, 단위 환산을 다룬다.",
    "수학과 - 직무 수학 - (2) 변화와 관계 - 11~12학년 - 업무와 관련해 비와 비율, 비율과 백분율, 규칙성과 변화, 표와 그래프, 식과 문제해결, 방정식과 부등식 등을 다룬다.",
    "수학과 - 직무 수학 - (3) 도형과 측정 - 11~12학년 - 업무와 관련해 도형의 관찰과 표현, 도형의 측정을 다룬다.",
    "수학과 - 직무 수학 - (4) 자료와 가능성 - 11~12학년 - 업무와 관련해 경우의 수와 가능성, 자료의 정리와 해석을 다룬다.",
    "수학과 - 수학과 문화 - (1) 예술과 수학 - 11~12학년 - 음악 속의 수학, 미술 속의 수학, 문학 속의 수학, 영화 속의 수학 등 예술 속의 수학을 다룬다.",
    "수학과 - 수학과 문화 - (2) 생활과 수학 - 11~12학년 - 스포츠 속의 수학, 게임 속의 수학, 디지털 기술 속의 수학, 투표 속의 수학 등 생활 속의 수학을 다룬다.",
    "수학과 - 수학과 문화 - (3) 사회와 수학 - 11~12학년 - 사회와 관련된 수학을 다룬다.",
    "수학과 - 수학과 문화 - (4) 환경과 수학 - 11~12학년 - 환경과 관련된 수학을 다룬다.",
    "수학과 - 실용 통계 - (1) 통계와 통계적 문제 - 11~12학년 - 실용적 차원에서 통계와 통계적 문제해결, 모집단과 표본 등을 다룬다.",
    "수학과 - 실용 통계 - (2) 자료의 수집과 정리 - 11~12학년 - 실용적 차원에서 자료의 종류, 자료의 수집, 자료의 표현과 요약 등을 다룬다.",
    "수학과 - 실용 통계 - (3) 자료의 분석 - 11~12학년 - 실용적 차원에서 통계적 추정과 통계적 검정을 다룬다.",
    "수학과 - 실용 통계 - (4) 통계적 탐구 - 11~12학년 - 실용적 차원의 통계적 탐구 활동을 다룬다.",
    "수학과 - 수학과제 탐구 - (1) 과제 탐구의 이해 - 11~12학년 - 수학 탐구의 의미와 필요성, 수학의 연구 윤리 등을 다룬다.",
    "수학과 - 수학과제 탐구 - (2) 과제 탐구의 방법과 절차 - 11~12학년 - 수학 문제를 해결하는 다양한 탐구 방법과 절차를 다룬다.",
    "수학과 - 수학과제 탐구 - (3) 과제 탐구의 실행 및 평가 - 11~12학년 - 수학 탐구 주제를 선정하고, 계획 수립, 탐구 수행, 탐구 결과 정리 및 발표, 반성 및 평가 등을 실시한다.",
    "과학과 - 통합과학1 - (1) 과학의 기초 - 10학년 - 기본량과 단위, 측정과 표준, 정보와 신호 등 과학의 기초적 언어를 다룬다.",
    "과학과 - 통합과학1 - (2) 물질과 규칙성 - 10학년 - 원소에 관한다. 우주 초기의 원소, 지구를 구성하는 원소, 생명체를 구성하는 원소, 원소의 결합, 원소의 주기성 등 원소와 관련한 주제를 다룬다.",
    "과학과 - 통합과학1 - (3) 시스템과 상호작용 - 10학년 - 지구 시스템과 생명 시스템을 다룬다. 지구 시스템과 관련해서는 판구조론과 지각 변동, 중력장 내의 운동, 충격량과 운동량 등을 다룬다. 생명 시스템과 관련해서는 세포, 물질대사, 유전자와 단백질 등을 다룬다.",
    "과학과 - 통합과학2 - (1) 변화와 다양성 - 10학년 - 생물의 변화와 화학의 변화를 다룬다. 생물의 변화와 관련해서는 지질시대의 생물과 화석, 지질시대 환경 변화와 대멸종, 자연선택, 생물다양성 등을 다룬다. 화학의 변화와 관련해서는 산화와 환원, 산성과 염기성, 중화 반응, 물질 변화에서의 에너지 출입 등을 다룬다.",
    "과학과 - 통합과학2 - (2) 환경과 에너지 - 10학년 - 환경과 에너지에 관한다. 생태계 구성 요소, 생태계 평형, 대기와 해양의 상호작용, 온실기체와 지구온난화, 핵융합, 발전, 에너지 전환과 효율 등을 다룬다.",
    "과학과 - 통합과학2 - (3) 과학과 미래 사회 - 10학년 - 과학기술의 발전이 미래 사회의 문제를 어떻게 해결할 수 있는지에 관한다. 과학기술의 발전 사례, 과학의 유용성, 과학기술의 윤리 등을 다룬다.",
    "과학과 - 과학탐구실험1 - (1) 과학의 본성과 역사 속의 과학 탐구 - 10학년 - 과학의 역사를 다룬다. 역사 속의 과학, 선조들의 과학, 위대한 과학적 발견, 패러다임의 전환을 가져온 실험 등을 다룬다.",
    "과학과 - 과학탐구실험1 - (2) 과학 탐구의 과정과 절차 - 10학년 - 과학의 탐구 방법과 탐구 과정, 탐구 절차를 다룬다.",
    "과학과 - 과학탐구실험2 - (1) 생활 속의 과학 탐구 - 10학년 - 제품 속 과학, 놀이 속 과학, 스포츠 속 과학, 문화예술 속 과학 등 생활 속의 과학을 다룬다.",
    "과학과 - 과학탐구실험2 - (2) 미래 사회와 첨단 과학 탐구 - 10학년 - 첨단 과학기술의 과학 원리, 과학기술 이용과 관련된 과학 윤리 및 안전 사항을 다룬다.",
    "과학과 - 물리학 - (1) 힘과 에너지 - 11~12학년 - 물리적 관점에서 힘과 에너지에 관한다. 물체의 운동을 힘과 에너지 관점에서 다룬다.",
    "과학과 - 물리학 - (2) 전기와 자기 - 11~12학년 - 전기와 자기, 전기장과 자기장, 전자기 유도, 전기 에너지, 정보 통신 기술 등을 다룬다.",
    "과학과 - 물리학 - (3) 빛과 물질 - 11~12학년 - 빛과 물질에 관한다. 빛과 물질의 이중성, 원자의 특성, 반도체 소자의 원리 등을 다룬다.",
    "과학과 - 화학 - (1) 화학의 언어 - 11~12학년 - 화학의 기초에 해당하는 내용을 다룬다.",
    "과학과 - 화학 - (2) 물질의 구조와 성질 - 11~12학년 - 화학적 관점에서 물질의 구조와 성질에 관한다. 분자 구조를 바탕으로 물질의 성질을 이해한다.",
    "과학과 - 화학 - (3) 화학 평형 - 11~12학년 - 화학 변화에 관한다. 화학 반응에서의 가역 반응, 변인에 따른 화학 변화의 방향성을 다룬다.",
    "과학과 - 화학 - (4) 역동적인 화학 반응 - 11~12학년 - 화학 반응에 관한다. 산과 염기의 반응, 중화 반응 등을 다룬다.",
    "과학과 - 생명과학 - (1) 생명 시스템의 구성 - 11~12학년 - 세포로부터 생태계에 이르는 생명의 구성 단계, 생물의 특성, 생명과학의 특성을 다룬다.",
    "과학과 - 생명과학 - (2) 항상성과 몸의 조절 - 11~12학년 - 생물학적 관점에서 자극과 반응, 항상성, 인체의 면역 반응을 다룬다.",
    "과학과 - 생명과학 - (3) 생명의 연속성과 다양성 - 11~12학년 - 생물학적 관점에서 유전과 생식, 진화와 생물의 다양성을 다룬다.",
    "과학과 - 지구과학 - (1) 대기와 해양의 상호작용 - 11~12학년 - 지구의 대기, 지구의 해양에 관한다. 대기와 해양의 상호작용으로 인한 기후변화를 다룬다.",
    "과학과 - 지구과학 - (2) 지구의 역사와 한반도의 암석 - 11~12학년 - 지구의 역사, 한반도의 암석을 다룬다.",
    "과학과 - 지구과학 - (3) 태양계 천체와 별과 우주의 진화 - 11~12학년 - 태양계 천체, 별과 우주의 진화를 다룬다.",
    "과학과 - 역학과 에너지 - (1) 시공간과 운동 - 11~12학년 - 중력으로 인한 물체, 인공위성, 행성의 운동을 다룬다. 중력이 시공간에 미치는 영향을 다룬다.",
    "과학과 - 역학과 에너지 - (2) 열과 에너지 - 11~12학년 - 에너지 관점에서 열 현상, 열기관, 열역학 법칙 등 열에 관해 다룬다.",
    "과학과 - 역학과 에너지 - (3) 탄성파와 소리 - 11~12학년 - 소리와 파동에 관한다. 매질을 통한 에너지의 전파, 파동의 투과와 반사, 음파의 간섭과 도플러 현상 등을 다룬다.",
    "과학과 - 전자기와 양자 - (1) 전자기적 상호작용 - 11~12학년 - 물질의 전기적 및 자기적 상호작용, 전기전자통신의 전자기적 원리 등을 다룬다.",
    "과학과 - 전자기와 양자 - (2) 빛과 정보 통신 - 11~12학년 - 빛의 여러 가지 특성(간섭, 편광, 굴절, 물질과의 상호작용 등)을 다룬다. 빛의 특성을 이용한 기술(광학 기기, 정보 통신 기술, 정밀 측정, 영상기술, 의료진단 기술 등)을 다룬다.",
    "과학과 - 전자기와 양자 - (3) 양자와 미시세계 - 11~12학년 - 양자역학과 미시세계를 다룬다.",
    "과학과 - 물질과 에너지 - (1) 물질의 세 가지 상태 - 11~12학년 - 우리 주변 물질의 상태와 관련된 화학적 현상을 다룬다.",
    "과학과 - 물질과 에너지 - (2) 용액의 성질 - 11~12학년 - 물의 성질, 용액의 성질을 다룬다.",
    "과학과 - 물질과 에너지 - (3) 화학 변화의 자발성 - 11~12학년 - 화학 반응에서의 에너지 출입, 엔탈피, 화학 변화의 방향을 다룬다.",
    "과학과 - 물질과 에너지 - (4) 반응 속도 - 11~12학년 - 화학 반응의 속도를 다룬다.",
    "과학과 - 화학 반응의 세계 - (1) 산 염기 평형 - 11~12학년 - 화학 평형과 관련해 산과 염기를 다룬다.",
    "과학과 - 화학 반응의 세계 - (2) 산화⋅환원 반응 - 11~12학년 - 화학 전지의 화학적 원리를 다룬다.",
    "과학과 - 화학 반응의 세계 - (3) 탄소 화합물과 반응 - 11~12학년 - 탄소 화합물의 화학 반응을 다룬다.",
    "과학과 - 세포와 물질대사 - (1) 세포 - 11~12학년 - 세포의 특성을 다룬다.",
    "과학과 - 세포와 물질대사 - (2) 물질대사와 에너지 - 11~12학년 - 생명체의 물질대사와 효소를 다룬다.",
    "과학과 - 세포와 물질대사 - (3) 세포호흡과 광합성 - 11~12학년 - 동물세포와 식물세포에서 일어나는 세포호흡과 광합성을 다룬다.",
    "과학과 - 생물의 유전 - (1) 유전자와 유전물질 - 11~12학년 - 생물의 유전, 유전물질과 유전체의 구성을 다룬다.",
    "과학과 - 생물의 유전 - (2) 유전자의 발현 - 11~12학년 - 유전자의 발현 과정, 유전자의 발현 조절을 다룬다.",
    "과학과 - 생물의 유전 - (3) 생명공학기술 - 11~12학년 - 생명공학기술의 발달과 관련 분야, 생명공학기술의 활용과 생명윤리를 다룬다.",
    "과학과 - 지구시스템과학 - (1) 지구 탄생과 생동하는 지구 - 11~12학년 - 지구시스템 중 지권에 관한다. 지구의 탄생과 지구시스템의 형성, 지권의 형성과 변화를 다룬다.",
    "과학과 - 지구시스템과학 - (2) 해수의 운동 - 11~12학년 - 지구시스템 중 수권에 관한다. 해류와 해파, 조석 등 해수의 운동과 순환을 다룬다.",
    "과학과 - 지구시스템과학 - (3) 강수 과정과 대기의 운동 - 11~12학년 - 지구시스템 중 기권에 관한다. 대기의 운동과 순환, 강수 과정을 다룬다.",
    "과학과 - 행성우주과학 - (1) 우주탐사와 행성계 - 11~12학년 - 우주탐사와 행성계에 관한다.",
    "과학과 - 행성우주과학 - (2) 태양과 별의 관측 - 11~12학년 - 태양과 별의 관측을 통해 알 수 있는 물리적 특징을 다룬다.",
    "과학과 - 행성우주과학 - (3) 은하와 우주 - 11~12학년 - 은하와 우주에 관한다.",
    "과학과 - 과학의 역사와 문화 - (1) 과학과 문명의 탄생과 통합 - 11~12학년 - 과학과 문명, 과학과 사회문화 사이의 상호작용을 다룬다.",
    "과학과 - 과학의 역사와 문화 - (2) 변화하는 과학과 세계 - 11~12학년 - 산업혁명 이후 과학기술이 사회문화에 미친 영향을 다룬다.",
    "과학과 - 과학의 역사와 문화 - (3) 과학과 인류의 미래 - 11~12학년 - 사회문화에서 과학의 역할, 과학기술의 발달로 인한 미래의 변화와 문제를 다룬다.",
    "과학과 - 기후변화와 환경생태 - (1) 기후와 환경생태의 특성 - 11~12학년 - 기후의 특성, 기후와 환경생태의 상호작용을 다룬다.",
    "과학과 - 기후변화와 환경생태 - (2) 기후위기와 환경생태 변화 - 11~12학년 - 기후위기의 원인, 기후위기에 따른 생태계의 변화를 다룬다.",
    "과학과 - 기후변화와 환경생태 - (3) 기후위기에 대응하는 우리의 노력 - 11~12학년 - 기후위기에 대한 대응을 다룬다.",
    "과학과 - 융합과학 탐구 - (1) 융합과학 탐구의 이해 - 11~12학년 - 융합과학기술의 역할과 유용성을 다룬다.",
    "과학과 - 융합과학 탐구 - (2) 융합과학 탐구의 과정 - 11~12학년 - 융합과학기술의 발전 과정을 다룬다.",
    "과학과 - 융합과학 탐구 - (3) 융합과학 탐구의 전망 - 11~12학년 - 융합과학기술의 전망을 다룬다."
  ],
  "중등": [
    "수학과 - 수학 - (1) 수와 연산 - 7~9학년 - 소인수분해, 정수와 유리수, 유리수와 순환소수, 제곱근과 실수 등을 다룬다.",
    "수학과 - 수학 - (2) 변화와 관계 - 7~9학년 - 문자의 사용과 식, 일차방정식, 좌표평면과 그래프, 식의 계산, 일차부등식, 연립일차방정식, 일차함수, 일차함수와 일차방정식의 관계, 다항식의 곱셈과 인수분해, 이차방정식, 이차함수 등을 다룬다.",
    "수학과 - 수학 - (3) 도형과 측정 - 7~9학년 - 기본 도형, 작도와 합동, 평면도형의 성질, 입체도형의 성질, 삼각형과 사각형의 성질, 도형의 닮음, 피타고라스 정리, 삼각비, 원의 성질 등을 다룬다.",
    "수학과 - 수학 - (4) 자료와 가능성 - 7~9학년 - 대푯값, 도수분포표와 상대도수, 경우의 수와 확률, 산포도, 산점도 등을 다룬다.",
    "과학과 - 과학 - (1) 과학과 인류의 지속가능한 삶 - 7~9학년 - 과학적 탐구 방법, 과학기술의 영향, 과학과 지속가능한 사회의 관계 등을 다룬다.",
    "과학과 - 과학 - (2) 생물의 구성과 다양성 - 7~9학년 - 생물의 특성에 관한다. 세포의 구조와 기능, 생물의 구성 단계, 변이와 생물다양성, 종의 분류, 생물의 계통 등을 다룬다.",
    "과학과 - 과학 - (3) 열 - 7~9학년 - 열에 관한다. 열평형, 전도, 대류, 복사, 비열, 열팽창 등을 다룬다.",
    "과학과 - 과학 - (4) 물질의 상태 변화 - 7~9학년 - 화학적 관점에서 물질의 상태를 다룬다. 입자의 운동과 입자 모형, 물질의 상태 변화와 열에너지 등을 다룬다.",
    "과학과 - 과학 - (5) 힘의 작용 - 7~9학년 - 물리적 힘에 관한다. 중력, 마찰력, 탄성력, 부력 등을 다룬다.",
    "과학과 - 과학 - (6) 기체의 성질 - 7~9학년 - 기체의 성질에 관한다. 기체의 압력, 기체의 온도, 기체의 부피 등을 다룬다.",
    "과학과 - 과학 - (7) 태양계 - 7~9학년 - 태양계에 관한다. 태양계 구성 천체, 태양 표면과 태양 활동, 달, 일식과 월식 등을 다룬다.",
    "과학과 - 과학 - (8) 물질의 특성 - 7~9학년 - 화학적 관점에서 물질의 특성을 다룬다. 밀도, 용해도, 녹는점, 끓는점, 순물질과 혼합물, 혼합물의 분리 등을 다룬다.",
    "과학과 - 과학 - (9) 지권의 변화 - 7~9학년 - 지구시스템 중 지권에 관한다. 광물과 암석, 풍화 작용, 판과 대륙이동설, 지진대와 화산대 등을 다룬다.",
    "과학과 - 과학 - (10) 빛과 파동 - 7~9학년 - 빛과 파동에 관한다. 시각과 상, 반사와 굴절, 거울과 렌즈, 빛의 합성과 색, 파동의 발생과 전달, 파동의 요소와 소리의 특성 등을 다룬다.",
    "과학과 - 과학 - (11) 물질의 구성 - 7~9학년 - 화학적 관점에서 물질의 구성에 관한다. 원소, 원자, 분자, 이온, 화합물, 화학식, 주기율표 등을 다룬다.",
    "과학과 - 과학 - (12) 식물과 에너지 - 7~9학년 - 식물의 호흡과 광합성을 다룬다.",
    "과학과 - 과학 - (13) 동물과 에너지 - 7~9학년 - 동물의 소화, 순환, 호흡, 배설에 관한다. 소화계, 순환계, 호흡계, 배설계를 다룬다.",
    "과학과 - 과학 - (14) 전기와 자기 - 7~9학년 - 전기력, 대전, 정전기 유도, 전압, 전류, 옴의 법칙, 전기 에너지, 자기력, 자기장 등을 다룬다.",
    "과학과 - 과학 - (15) 별과 우주 - 7~9학년 - 별, 은하, 우주 등을 다룬다.",
    "과학과 - 과학 - (16) 화학 반응의 규칙성 - 7~9학년 - 화학 변화에 관한다. 화학 반응, 질량 보존 법칙, 일정 성분비 법칙, 기체 반응 법칙, 화학 반응에서 열에너지의 출입 등을 다룬다.",
    "과학과 - 과학 - (17) 날씨와 기후변화 - 7~9학년 - 지구시스템 중 기권에 관한다. 대기권, 온실효과, 지구온난화, 대기 대순환, 강수 과정, 기압과 기단, 전선, 일기도 등을 다룬다.",
    "과학과 - 과학 - (18) 수권과 해수의 순환 - 7~9학년 - 지구시스템 중 수권에 관한다. 해수의 특성, 해양의 층상구조, 수권과 수자원, 염분과 해류 등을 다룬다.",
    "과학과 - 과학 - (19) 운동과 에너지 - 7~9학년 - 물체의 운동에 관한다. 등속 운동, 자유 낙하 운동, 위치 에너지, 운동 에너지, 역학적 에너지의 전환과 보존 등을 다룬다.",
    "과학과 - 과학 - (20) 자극과 반응 - 7~9학년 - 생물학적 관점에서 자극과 반응에 관한다. 여러 가지 감각(시각, 후각, 청각, 미각, 촉각), 뉴런과 신경계, 호르몬과 항상성 등을 다룬다.",
    "과학과 - 과학 - (21) 생식과 유전 - 7~9학년 - 생물의 생식과 유전에 관한다. 세포분열, 동물 개체의 발생, 염색체와 유전자 등을 다룬다.",
    "과학과 - 과학 - (22) 재해·재난과 안전 - 7~9학년 - 재해와 재난 및 재해, 재난에 대한 과학적 대처 방안을 다룬다.",
    "과학과 - 과학 - (23) 과학과 나의 미래 - 7~9학년 - 과학 관련 진로와 직업을 다룬다."
  ],
  "초등": [
    "수학과 - 수학 - (1) 수와 연산 - 1~2학년 - 네 자리 이하의 수, 두 자리 수 범위의 덧셈과 뺄셈, 한 자리 수의 곱셈 등을 다룬다.",
    "수학과 - 수학 - (2) 변화와 관계 - 1~2학년 - 규칙을 다룬다.",
    "수학과 - 수학 - (3) 도형과 측정 - 1~2학년 - 입체도형, 평면도형, 양의 비교, 시각과 시간, 길이 등을 다룬다.",
    "수학과 - 수학 - (4) 자료와 가능성 - 1~2학년 - 자료의 분류, 표, 그래프 등을 다룬다.",
    "수학과 - 수학 - (1) 수와 연산 - 3~4학년 - 다섯 자리 이상의 수, 분수, 소수, 세 자리 수의 덧셈과 뺄셈, 자연수의 곱셈과 나눗셈, 분모가 같은 분수의 덧셈과 뺄셈, 소수의 덧셈과 뺄셈 등을 다룬다.",
    "수학과 - 수학 - (2) 변화와 관계 - 3~4학년 - 규칙, 동치 관계를 다룬다.",
    "수학과 - 수학 - (3) 도형과 측정 - 3~4학년 - 도형의 기초, 원의 구성 요소, 여러 가지 삼각형, 여러 가지 사각형, 다각형, 평면도형의 이동, 시각과 시간, 길이, 들이, 무게, 각도 등을 다룬다.",
    "수학과 - 수학 - (4) 자료와 가능성 - 3~4학년 - 그림그래프, 막대그래프, 꺾은선그래프 등을 다룬다.",
    "수학과 - 수학 - (1) 수와 연산 - 5~6학년 - 약수와 배수, 수의 범위와 올림, 버림, 반올림, 자연수의 혼합 계산, 분모가 다른 분수의 덧셈과 뺄셈, 분수의 곱셈과 나눗셈, 소수의 곱셈과 나눗셈 등을 다룬다.",
    "수학과 - 수학 - (2) 변화와 관계 - 5~6학년 - 대응 관계, 비와 비율, 비례식과 비례배분을 다룬다.",
    "수학과 - 수학 - (3) 도형과 측정 - 5~6학년 - 합동과 대칭, 직육면체와 정육면체, 각기둥과 각뿔, 원기둥, 원뿔, 구, 다각형의 둘레와 넓이, 원주율과 원의 넓이, 직육면체와 정육면체의 겉넓이와 부피 등을 다룬다.",
    "수학과 - 수학 - (4) 자료와 가능성 - 5~6학년 - 평균, 띠그래프, 원그래프, 가능성 등을 다룬다.",
    "과학과 - 과학 - (1) 힘과 우리 생활 - 3~4학년 - 생활 속 힘의 작용에 관한다. 밀기, 당기기, 무게, 수평잡기, 도구의 이용 등을 다룬다.",
    "과학과 - 과학 - (2) 동물의 생활 - 3~4학년 - 여러 가지 동물과 곤충에 관한다. 여러 가지 동물의 특징과 생김새, 동물의 서식 환경, 동물의 분류, 동물의 이용 등을 다룬다.",
    "과학과 - 과학 - (3) 식물의 생활 - 3~4학년 - 여러 가지 식물에 관한다. 여러 가지 식물의 특징과 생김새, 식물의 서식 환경, 식물의 분류, 식물의 이용 등을 다룬다.",
    "과학과 - 과학 - (4) 생물의 한살이 - 3~4학년 - 여러 가지 생물의 한살이에 관한다. 동물의 한살이, 식물의 한살이, 식물의 성장 조건 등을 다룬다.",
    "과학과 - 과학 - (5) 물체와 물질 - 3~4학년 - 화학적 관점에서 물질의 성질, 물질의 세 가지 상태를 다룬다.",
    "과학과 - 과학 - (6) 지구와 바다 - 3~4학년 - 바다에 관한다. 바다의 특징, 밀물과 썰물, 파도, 바다 주변의 지형, 갯벌 등을 다룬다.",
    "과학과 - 과학 - (7) 소리의 성질 - 3~4학년 - 소리에 관한다. 소리의 발생, 소리의 세기, 소리의 높낮이, 소리의 전달 등을 다룬다.",
    "과학과 - 과학 - (8) 감염병과 건강한 생활 - 3~4학년 - 질병과 예방, 감염병 등을 다룬다.",
    "과학과 - 과학 - (9) 자석의 이용 - 3~4학년 - 자석에 관한다. 자석과 물체 사이의 힘, 자석과 자석 사이의 힘, 자석의 극, 자석의 이용 등을 다룬다.",
    "과학과 - 과학 - (10) 물의 상태 변화 - 3~4학년 - 화학적 관점에서 물의 상태 변화를 다룬다.",
    "과학과 - 과학 - (11) 땅의 변화 - 3~4학년 - 강 주변의 지형, 화산 활동, 화성암, 지진 등을 다룬다.",
    "과학과 - 과학 - (12) 다양한 생물과 우리 생활 - 3~4학년 - 균류, 원생생물, 세균 등을 다룬다. 생명과학과 우리 생활의 관계를 다룬다.",
    "과학과 - 과학 - (13) 밤하늘 관찰 - 3~4학년 - 달, 태양계, 별, 별자리 등을 다룬다.",
    "과학과 - 과학 - (14) 생물과 환경 - 3~4학년 - 생물과 환경의 관계를 다룬다. 생물 요소와 비생물 요소, 먹이사슬과 먹이그물, 환경오염이 생물에 미치는 영향 등을 다룬다.",
    "과학과 - 과학 - (15) 여러 가지 기체 - 3~4학년 - 기체에 관한다. 기체의 무게, 온도와 압력에 따른 기체의 부피 변화, 기체의 성질 등을 다룬다.",
    "과학과 - 과학 - (16) 기후변화와 우리 생활 - 3~4학년 - 기후변화를 다룬다.",
    "과학과 - 과학 - (1) 지층과 화석 - 5~6학년 - 지층과 화석에 관한다. 지층, 퇴적암, 화석, 과거 지구의 생물과 환경 등을 다룬다.",
    "과학과 - 과학 - (2) 빛의 성질 - 5~6학년 - 빛의 성질에 관한다. 빛의 직진, 빛의 반사, 빛의 굴절, 렌즈 등을 다룬다.",
    "과학과 - 과학 - (3) 용해와 용액 - 5~6학년 - 용해와 용액에 관한다. 용액, 용매, 용질, 용해, 용액의 농도 등을 다룬다.",
    "과학과 - 과학 - (4) 우리 몸의 구조와 기능 - 5~6학년 - 인체에 관한다. 뼈, 근육, 소화 기관, 순환 기관, 호흡 기관, 배설 기관, 질병 등을 다룬다.",
    "과학과 - 과학 - (5) 혼합물의 분리 - 5~6학년 - 여러 가지 혼합물의 분리, 정화의 원리 등을 다룬다.",
    "과학과 - 과학 - (6) 날씨와 우리 생활 - 5~6학년 - 날씨에 관한다. 기상 요소, 이슬, 안개, 구름, 고기압과 저기압 등을 다룬다.",
    "과학과 - 과학 - (7) 열과 우리 생활 - 5~6학년 - 생활 속의 열에 관한다. 온도, 열의 이동, 단열 등을 다룬다.",
    "과학과 - 과학 - (8) 자원과 에너지 - 5~6학년 - 자원과 에너지에 관한다. 자원의 종류, 자원의 이용, 지속가능한 에너지 등을 다룬다.",
    "과학과 - 과학 - (9) 산과 염기 - 5~6학년 - 산과 염기에 관한다. 지시약, 산성 용액, 염기성 용액 등을 다룬다.",
    "과학과 - 과학 - (10) 물체의 운동 - 5~6학년 - 물체의 운동에 관한다. 물체의 위치 변화, 속력 등을 다룬다.",
    "과학과 - 과학 - (11) 식물의 구조와 기능 - 5~6학년 - 식물의 구조와 기능에 관한다. 세포의 구조, 여러 가지 식물의 특징, 식물의 기관(뿌리, 줄기, 잎, 꽃), 광합성 등을 다룬다.",
    "과학과 - 과학 - (12) 지구의 운동 - 5~6학년 - 지구의 자전과 공전에 관한다. 태양과 별의 위치 변화, 계절별 별자리 등을 다룬다.",
    "과학과 - 과학 - (13) 계절의 변화 - 5~6학년 - 태양 고도의 변화, 계절별 낮의 길이 등을 다룬다.",
    "과학과 - 과학 - (14) 물질의 연소 - 5~6학년 - 물질의 연소에 관한다. 연소 조건, 연소 생성물 등을 다룬다.",
    "과학과 - 과학 - (15) 전기의 이용 - 5~6학년 - 전기의 이용에 관한다. 전기 회로, 직렬연결과 병렬연결, 전자석, 전기 안전 등을 다룬다.",
    "과학과 - 과학 - (16) 과학과 나의 진로 - 5~6학년 - 과학 관련 진로와 직업을 다룬다."
  ]
}